app/controllers/emperors_controller.rb

	def index
		@emperors = Emperor.all
---
SELECT "emperors".* FROM "emperors"

	def show
		@emperor = Emperor.find_by_id(params[:id])
---
SELECT  "emperors".* FROM "emperors" WHERE "emperors"."id" = $1 LIMIT 1  [["id", 1]]