app/controllers/traits_controller.rb

	def index
		@traits = Trait.all
---
SELECT "traits".* FROM "traits"